# __init__.py 为初始化加载文件
# 导入-节点检索库
import json
from .ui import 功能开关

# 初始化锁
全局功能开关 = 功能开关
功能配置 = {'配置1': 功能开关['配置1'], '配置2': 功能开关['配置2'], '配置3': 功能开关['配置3'], '配置4': 功能开关['配置4'],
            '配置5': 功能开关['配置5']}

def loadConfig(configNum):
    global 全局功能开关
    configName = '配置'+ str(configNum)
    new = json.loads(功能配置[configName])
    # for index, value in new.items():
    #     功能开关[index] = value
    # print(222)
    全局功能开关 = new
    print(全局功能开关)
    return 全局功能开关

# thread_main_paused = False
# thread_main_cond = threading.Condition()

任务记录 = {
    "当前任务账号": 功能开关["选择启动账号"],
    "当前任务角色": 功能开关["选择启动角色"],
}

def 初始化任务记录():
    # 日常
    任务记录.update({
        "仓鼠百货-完成": 0,
        "邮件领取-完成": 0,
        "寻找结伴-完成": 0,
    })

    # 旅团
    任务记录.update({
        "旅团-浇树-完成": 0,
        "旅团-调查队-完成": 0,
        "旅团-许愿墙-完成": 0,
        "旅团-任务-完成": 0,
        "旅团-商店-完成": 0,
    })

    # 旅人
    任务记录.update({
        "旅人-猫猫果木-完成": 0,
        "日常-招式创造-完成": 0,
        "日常-骑兽乐园-完成": 0,
        "日常-释放1次战术技能-完成": 0,
        "日常-洗练1次装备-完成": 0,
        "日常-升级1次麦乐兽-完成": 0,
        "试炼-秘境-体力消耗完成": 0,
        "试炼-恶龙-完成次数": 0,
        "日常-宝藏湖-完成": 0,
    })

    # 营地
    任务记录.update({
        "月签到-完成": 0,
        "月卡-完成": 0,
        "日礼包-完成": 0,
        "露营打卡点-完成": 0,
        "秘宝领取-完成": 0,
        "限时特惠-完成": 0,
        "登录好礼-完成": 0,
        "箱庭苗圃-倒计时": 0,
        "箱庭苗圃-完成": 0,
        "队伍喊话-倒计时": 0,
        "世界喊话-倒计时": 0,
    })
